          #1. Ввести числа. Визначити максимальне та мінімальне.
# num_list = [int(input("Введіть число {}: ".format(i+1))) for i in range(int(input("Введіть кількість чисел: ")))]
# print(num_list)
# print("  Максимальне число є:", max(num_list))
# print("  Мінімальне  число є:", min(num_list))



          #2. Від одного до десяти, визначити парні\2, непарні\3 та числа які не діляться на 2 і 3.
# for x in range(1, 11):
#     if x % 2 == 0:
#         print(x, ':Парне, ділиться на 2.')
#     elif x % 3 == 0:
#         print(x, ':Непарне, ділиться на 3.')
#     else:
#         print(x, ':Не ділиться на 2 та 3.')



          #3. Факторіал числа.
# n=int(input('Введіть факторіал: '))
# factorial = 1
# for i in range(2, n+1):
#     factorial *= i
# print(factorial)

          
          
          #4. Логін
# log=('First')
# n=(input('Введіть логін: '))
# while n == log:
#     print('Привіт! Логін вірний.')
#     break
# else:
#     print('Логін невірний.')
    


          #5. Введіть числа. Зупинити виконання коли зустрінеться від'ємне або нуль.

# ch = int(input('Введіть число більше нуля: '))
# while ch > 0:
#     if ch > 0:
#       ch = int(input('Введіть число більше нуля: '))
# else:
#     print('Ви ввели число менше або рівне нулю.')



          # 7.  Знайти прості числа від 10 до 30,
          # а всі решта чисел представити у вигляді добутку чисел.

# for bas in range(10,31):
#     if bas % 2!=0 and bas % 3 !=0:
#         print([bas], ' - просте')
#     elif bas % 2 == 0:
#         d=int(bas/2)
#         print([bas],' - це як 2 *',d)
