#*args    tuple
#**kwargs lib
          
          #1. Написати функцію, яка знаходить середнє арифметичне значення довільної кількості чисел. 

# def sa(*args):
#     '''1. Написати функцію, яка знаходить середнє арифметичне значення довільної кількості чисел. '''
#     return sum(args)/len(args)
# print(sa(10, 20, 30))



          #2. Написати функцію, яка повертає абсолютне значення числа.

# def absolut(a):
#     '''2. Написати функцію, яка повертає абсолютне значення числа'''
#     if a>=0:
#         print(a)
#     else:
#         print(-a)
#     return
# print(absolut(-5))



          #3. Написати функцію, яка знаходить максимальне число з двох чисел, а також в функції використати рядки документації DocStrings.

# def minmax(a,b):
#     '''3. Написати функцію, яка знаходить максимальне число з двох чисел, а також в функції використати рядки документації DocStrings.'''
#     print(max(a,b))
#     return
# minmax(4,5)



          #4. Написати програму, яка обчислює площу прямокутника, трикутника та кола 
          # (написати три функції для обчислення площі, і викликати їх в головній програмі в залежності від вибору користувача).

# def pr(a,b):
#     print('Площа прямокутника: ', a*b)
#     return
# def tr(c,d,e,p):
    
#     print('Площа трикутника: ',  ((p*(p-c)*(p-d)*(p-e))**0.5))
#     return
# def cl(r):
#     print('Площа круга: ', (3.14*(r**2)))
#     return
# i=input("Для вибору обчислення площі прямокутника натисніть: 1\nДля вибору обчислення площі трикутника натисніть: 2\nДля вибору обчислення площі кола натисніть: 3\nЗробіть свій вибір:  ")
# if i == '1':
#     a=int(input('Введіть першу сторону прямокутника: '))
#     b=int(input('Введіть другу сторону прямокутника: '))
#     pr(a, b)

# elif i == '2':
#     c=int(input('Введіть першу сторону трикутника: '))
#     d=int(input('Введіть другу сторону трикутника: '))
#     e=int(input('Введіть третю сторону трикутника: '))
#     tr(c, d, e, p=((c+d+e)/2))
# elif i == '3':
#     r=int(input('Введіть радіус круга: '))
#     cl(r)
# else:
#     print('Error')



          #5. Написати функцію, яка обчислює суму цифр введеного числа.

# def s(число):
#     print(sum(map(int, list(число))))
#     return
# x=input('Введіть число: ')
# s(x)



          #6. Написати програму калькулятор.

# def calc(a, b):
#     operation = input('Виберіть дію яку потрібно виконати:\nНатисніть + для додаванння.\nНатисніть - для віднімання.\nНатисніть * для множенння.\nНатисніть / для діленння.\nДля виходу натисніть X.\nЗробіть свій вибір:  ')
#     a=input('Введіть число A: ')
#     b=input('Введіть число B: ')
#     while operation == '+':
#         print(calc(a+b))

# def dod():
#     a = float(input('Введіть перше число:'))
#     b = float(input('Введіть друге число:'))
#     print('Сума чисел:', a+b)
#     v = input("Щоб продовжити додавання натисніть: +\nДля виходу в головне меню натисніть: X\nЗробіть свій вибір:")
#     while v =="+" or "x":
#         if v == "+":
#             return dod()
#         else:
#             return golovna()

# def vid():
#     a = float(input('Введіть перше число:'))
#     b = float(input('Висоту, друге число:'))
#     print("Різниця чисел:", a-b)
#     v = input("Щоб продовжити віднімання натисніть: -\nДля виходу в головне меню натисніть: X\nЗробіть свій вибір:  ")
#     while v =="-" or "x":
#         if v == "-":
#             return vid()
#         else:
#             return golovna()

# def golovna():
#     n = input('Виберіть дію яку потрібно виконати:\nНатисніть + для додаванння.\nНатисніть - для віднімання.\nДля виходу з програми натисніть X.\nЗробіть свій вибір:  ')
#     while n == "+" or "-" or "x":
#         if n == "+":
#             dod()
#         elif n == "-":
#             vid()
#         elif n == "x":
#             print("Дякую що скористалися нашим калькулятором!")
#             exit()
#         else:
#             print("?")
#             break
# golovna()



          #6. Побудувати рекурсивну функцію обчислення чисел Фібоначі до числа введеного користувачем.

# def fibonachi(n):
#     if n in (1, 2):
#         return 1
#     return fibonachi(n - 1) + fibonachi(n - 2)
# x=int(input('Введіть число Фібоначі: '))
# print(fibonachi(x))



          #7. Написати програму, яка обчислює дискримінант квадратного рівняння.

# def dys():
#     a = float(input("Введіть а:"))
#     b = float(input("Введіть b:"))
#     c = float(input("Введіть c:"))
#     print("D=", b**2-4*a*c)





    






