          #1.1. Програма для пошуку Is, Better, Never в тексті.
# print('Програма для пошуку Is, Better, Never в тексті')
# zen=input("Введіть рядок з філософії пайтона:").split() 
# x=(zen.count('is'))
# y=(zen.count('better'))
# z=(zen.count('never'))
# print('Is: ', x )
# print('Better: ', y)
# print('Never: ', z)
         
         
         
          #1.2. Програма для виведення тексту у верхньому регістрі.
# print('Програма для виведення тексту у верхньому регістрі')
# zen=input('Введіть текст:')
# x=(zen.upper())
# print(x)



          #1.3. Програма для заміни 'I' на '&' у введенному тексті.
# print("Програма для заміни 'I' на '&' у введенному тексті")
# zen=input('Введіть текст:')
# x=(zen.replace('i', '&'))
# print(x)



          #2. Знайти добуток числа, записати його в реверсивному порядку та посортувати.
# a = int(input("Введіть чотирьохзначне натуральне число: "))
# d4 = a % 10 #Четверта цифра
# a = a // 10
# d3 = a % 10 #Третя цифра
# a = a // 10
# d2 = a % 10 #Друга цифра
# a = a // 10
# d1 = a % 10 #Перша цифра
# print("Добуток цифер числа рівний:", d1*d2*d3*d4)
# print("Число в реверсному порядку:", d4, d3, d2, d1)
# print("Посортованні цифри за зростанням:", sorted([d1, d2, d3, d4]))



          #3. Поміняти між собою значення двох змінних, не використовуючи третьої змінної.
# a = str(input("Введіть змінну №1: "))
# b = str(input("Введіть змінну №2: "))
# a, b = b, a
# print("       Заміна змінних......")
# print("№1=", a)
# print("№2=", b)




